### Types of Data - NOIR (Nominal Ordinal Interval Ratio)
*Nominal* : Qualitative Data with no inherent order. Ex - Gender column

*Oridnal* : Qualitative data with inherent order. Ex - year of different course completion

*Interval* : It is a type of nuemrical data where we have upper and lower intervals and we can compute the difference between two values. Eg - Temp range on a thermometer, dates on a calender for a month

*Ratio* : They represent numerical data in terms of measured quantities, eg - sales of mobile phones, income etc.

Notes
1) Nominal and Ordinal are Qualitative data, which cant be measured

### Terminologies
We have two types of data in Pandas

1) Series<br>
a) Single column data is referred to as a Series.<br>
b) It will definitely contain an index column.<br>
c) It may contain more than 1 index as well but data column will only be 1

2) DataFrame<br>
a) Data organized into rows and columns is referred to as DataFrame.<br>
b) It will defintely contain row/(s) and column/(s)<br>
c) It can contain multiple index and/or columns as well.

##### Note
Series will always contain single column data. DataFrame can also contain a single column data but series cannot bear multiple column data.

In [1]:
import pandas as pd

### Series
1) By default Series indexes start from 0

In [2]:
s1 = pd.Series([10,20,30,45,56,67,78])
print(s1)
print(type(s1))

0    10
1    20
2    30
3    45
4    56
5    67
6    78
dtype: int64
<class 'pandas.core.series.Series'>

In [3]:
print(s1.index)
print(s1.values)
print(s1.index.tolist())

RangeIndex(start=0, stop=7, step=1)
[10 20 30 45 56 67 78]
[0, 1, 2, 3, 4, 5, 6]

In [4]:
# index in Series by default starts at 0 but it can be customized
s2 = pd.Series([23,34,24,35,25,36,26,37],index=list(range(10,18)))
# s2.index = []
print(s2)

10    23
11    34
12    24
13    35
14    25
15    36
16    26
17    37
dtype: int64

In [5]:
print(s2.sum())
print(s2.mean())
print(s2.median())
print(s2.cumsum())  # cumultaive sum
print(s2.cumprod())

240
30.0
30.0
10     23
11     57
12     81
13    116
14    141
15    177
16    203
17    240
dtype: int64
10              23
11             782
12           18768
13          656880
14        16422000
15       591192000
16     15370992000
17    568726704000
dtype: int64

#### Creating Series using List, tuple

In [6]:
w1 = [5,9,8,10,12,13]
w2 = (10,12,14,16,18,20)

q1 = pd.Series(w1)  # series made up of list
q2 = pd.Series(w2)  # series made up of tuple

In [7]:
print(q1)

0     5
1     9
2     8
3    10
4    12
5    13
dtype: int64

In [8]:
print(q2)

0    10
1    12
2    14
3    16
4    18
5    20
dtype: int64

In [9]:
print(type(q1))
print(type(q2))

<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>

In [10]:
w2 = {5,8,10,12,15,20}
q3 = pd.Series(w2)      # Series cant be created with Set
print(s3)

TypeError: 'set' type is unordered

In [11]:
w3 = {'k1':2,'k2':4,'k3':8,'k4':16}
q4 = pd.Series(w3)   # dict keys are considered as index and its values are considered as the values
q4

k1     2
k2     4
k3     8
k4    16
dtype: int64

In [12]:
w4 = {'k1':2,'k2':4,'k3':8,'k4':4}
q5 = pd.Series(w4.keys(),index=w4.values())   
# dict keys are considered as values and its index as the keys.
q5

2    k1
4    k2
8    k3
4    k4
dtype: object

In [13]:
q5[4]

4    k2
4    k4
dtype: object

### DataFrame

#### Methods to Create DataFrame

1) Using Dictionary<br>
Keys of the dictionary will be used as column names and the values will populate the cells, row wise

In [14]:
data  = {"Name": ['Ankit','Hemant','Srinivas','Aniruddha','Vishnavi','Akhila'],
         'Age':[21,22,20,19,20,21],
         'City':['Mathura','Vrindavan','Ayodhya','Varanasi','Puri','Prayagraj']}
df = pd.DataFrame(data)
df.head()

        Name  Age       City
0      Ankit   21    Mathura
1     Hemant   22  Vrindavan
2   Srinivas   20    Ayodhya
3  Aniruddha   19   Varanasi
4   Vishnavi   20       Puri

In [15]:
# top 5 rows by default, otherwise top n rows,where n is the parameter of head function 
df.head()

        Name  Age       City
0      Ankit   21    Mathura
1     Hemant   22  Vrindavan
2   Srinivas   20    Ayodhya
3  Aniruddha   19   Varanasi
4   Vishnavi   20       Puri

In [16]:
# bottom 5 rows by default, otherwise bottom n rows, where n is the parameter of tail function 
df.tail()

        Name  Age       City
1     Hemant   22  Vrindavan
2   Srinivas   20    Ayodhya
3  Aniruddha   19   Varanasi
4   Vishnavi   20       Puri
5     Akhila   21  Prayagraj

In [17]:
# 1 random row by default, otherwise n random rows where n is passed as an argument.
df.sample(3)

        Name  Age      City
3  Aniruddha   19  Varanasi
4   Vishnavi   20      Puri
0      Ankit   21   Mathura

#### Add a New Column to the DataFrame

In [18]:
df['Course'] = ['BTech','MCA','BCA','BCom','MBA','MA']
df.head(6)

        Name  Age       City Course
0      Ankit   21    Mathura  BTech
1     Hemant   22  Vrindavan    MCA
2   Srinivas   20    Ayodhya    BCA
3  Aniruddha   19   Varanasi   BCom
4   Vishnavi   20       Puri    MBA
5     Akhila   21  Prayagraj     MA

In [19]:
df.shape
# (rows,columns)

(6, 4)

In [20]:
print(df.columns)
print(type(df.columns))
print(df.columns.tolist())

Index(['Name', 'Age', 'City', 'Course'], dtype='object')
<class 'pandas.core.indexes.base.Index'>
['Name', 'Age', 'City', 'Course']

In [21]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    6 non-null      object
 1   Age     6 non-null      int64
 2   City    6 non-null      object
 3   Course  6 non-null      object
dtypes: int64(1), object(3)
memory usage: 320.0+ bytes

In [22]:
df.describe()

             Age
count   6.000000
mean   20.500000
std     1.048809
min    19.000000
25%    20.000000
50%    20.500000
75%    21.000000
max    22.000000

In [23]:
# Fetch single column data from df
print(df['City'])

0      Mathura
1    Vrindavan
2      Ayodhya
3     Varanasi
4         Puri
5    Prayagraj
Name: City, dtype: object

In [24]:
print(type(df['City']))

<class 'pandas.core.series.Series'>

In [25]:
#### Fetch multiple columns
w1 = df[['Age','Name','Course']]
w1

   Age       Name Course
0   21      Ankit  BTech
1   22     Hemant    MCA
2   20   Srinivas    BCA
3   19  Aniruddha   BCom
4   20   Vishnavi    MBA
5   21     Akhila     MA

In [26]:
print(type(w1))

<class 'pandas.core.frame.DataFrame'>

In [27]:
w2 = df[['Course']]
print(type(w2))

<class 'pandas.core.frame.DataFrame'>

In [28]:
w2

  Course
0  BTech
1    MCA
2    BCA
3   BCom
4    MBA
5     MA

2) Using List of List<BR>
1) From each list, a row in dataframe will be populated

In [29]:
data2 = [[123,'Rohit',78],
        [124,'Shreya',87],
        [125,'Payal',93],
        [126,'Shrishti',73]]
print(data2)
print(type(data2))

[[123, 'Rohit', 78], [124, 'Shreya', 87], [125, 'Payal', 93], [126, 'Shrishti', 73]]
<class 'list'>

In [30]:
df2 = pd.DataFrame(data2,columns=['R_No','Name','Marks'])
df2

   R_No      Name  Marks
0   123     Rohit     78
1   124    Shreya     87
2   125     Payal     93
3   126  Shrishti     73

3) Using Series

In [31]:
n1 = pd.Series([10,20,30])
n2 = pd.Series([15,25,35])
print(n1)
print(n2)

0    10
1    20
2    30
dtype: int64
0    15
1    25
2    35
dtype: int64

In [32]:
data3 = {'n1':n1,'n2':n2}
df3 = pd.DataFrame(data3)   # populating the DataFrame column wise from Series
df3.head()

   n1  n2
0  10  15
1  20  25
2  30  35

In [33]:
data4,data5 = {'n1':n1},{'n1':n2}
df4 = pd.DataFrame(data4)  # populating the Series row wise
df4

   n1
0  10
1  20
2  30

In [34]:
df5 = pd.DataFrame(data5)
df5

   n1
0  15
1  25
2  35

In [35]:
res_df = df4.append(df5)
res_df

C:\Users\world\AppData\Local\Temp\ipykernel_13592\2492112724.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  res_df = df4.append(df5)

   n1
0  10
1  20
2  30
0  15
1  25
2  35

#### Sorting columns by values

In [36]:
df2.head()

   R_No      Name  Marks
0   123     Rohit     78
1   124    Shreya     87
2   125     Payal     93
3   126  Shrishti     73

In [37]:
df2.sort_values(by='Marks') # default sort is ascending

   R_No      Name  Marks
3   126  Shrishti     73
0   123     Rohit     78
1   124    Shreya     87
2   125     Payal     93

In [38]:
df2

   R_No      Name  Marks
0   123     Rohit     78
1   124    Shreya     87
2   125     Payal     93
3   126  Shrishti     73

In [39]:
df

        Name  Age       City Course
0      Ankit   21    Mathura  BTech
1     Hemant   22  Vrindavan    MCA
2   Srinivas   20    Ayodhya    BCA
3  Aniruddha   19   Varanasi   BCom
4   Vishnavi   20       Puri    MBA
5     Akhila   21  Prayagraj     MA

In [40]:
df.sort_values(by='Name',ascending=False)

        Name  Age       City Course
4   Vishnavi   20       Puri    MBA
2   Srinivas   20    Ayodhya    BCA
1     Hemant   22  Vrindavan    MCA
0      Ankit   21    Mathura  BTech
3  Aniruddha   19   Varanasi   BCom
5     Akhila   21  Prayagraj     MA

#### Sort Index<br>
Columns are consideered as index at axis=1<br>
Index are consideered as index at axis=0

In [41]:
df.sort_index(axis=1,ascending=False) # column wise sorting in descending order

        Name Course       City  Age
0      Ankit  BTech    Mathura   21
1     Hemant    MCA  Vrindavan   22
2   Srinivas    BCA    Ayodhya   20
3  Aniruddha   BCom   Varanasi   19
4   Vishnavi    MBA       Puri   20
5     Akhila     MA  Prayagraj   21

In [42]:
df.sort_index(axis=0,ascending=False)

        Name  Age       City Course
5     Akhila   21  Prayagraj     MA
4   Vishnavi   20       Puri    MBA
3  Aniruddha   19   Varanasi   BCom
2   Srinivas   20    Ayodhya    BCA
1     Hemant   22  Vrindavan    MCA
0      Ankit   21    Mathura  BTech

#### Set a column as the index of dataframe

In [43]:
df5 = df.set_index('Course')
df5

             Name  Age       City
Course
BTech       Ankit   21    Mathura
MCA        Hemant   22  Vrindavan
BCA      Srinivas   20    Ayodhya
BCom    Aniruddha   19   Varanasi
MBA      Vishnavi   20       Puri
MA         Akhila   21  Prayagraj

In [44]:
df.head()

        Name  Age       City Course
0      Ankit   21    Mathura  BTech
1     Hemant   22  Vrindavan    MCA
2   Srinivas   20    Ayodhya    BCA
3  Aniruddha   19   Varanasi   BCom
4   Vishnavi   20       Puri    MBA

### Filtering

Q) Filter all records from df where Age is even

In [45]:
df[df['Age']%2==0]

       Name  Age       City Course
1    Hemant   22  Vrindavan    MCA
2  Srinivas   20    Ayodhya    BCA
4  Vishnavi   20       Puri    MBA

In [46]:
df.query('Age%2!=0')

        Name  Age       City Course
0      Ankit   21    Mathura  BTech
3  Aniruddha   19   Varanasi   BCom
5     Akhila   21  Prayagraj     MA

In [47]:
df.query('Name=="Ankit" or Course=="BCom"')

        Name  Age      City Course
0      Ankit   21   Mathura  BTech
3  Aniruddha   19  Varanasi   BCom